# Data Cleaning

Data in the real world is not always obtained in a beautiful organized form. This is actually very rare. 

In most casses data is "dirty" and requires a significant amount of cleaning before it can be useful. 

The process of obtaining good data from "dirty" data is called **Data Cleaning**. The process of data cleaning actually takes a significant amount of time of a Data Scientist.

[Cleaning Big Data: Most Time-Consuming, Least Enjoyable Data Science Task, Survey Says](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#ecedbfe6f637m)

<img src="assets/most_time_ds.jpg" width=600 height=600 />
<img src="assets/least_enjoyable_ds.jpg" width=600 height=600 />

## What is "Dirty Data" ???

Examples of dirty data is as follows: 
- Null values (NAN, nan, empty values ) 
- Mistakes and inconsistancies in spelling ( "Malaysia", "Msia","MALAYSIA", "MY", "MalAySIA", "M laysia", "malaysia______")
- Inconsistant types of data, in a column -( Int, Float, "string" )

### Why do I need Python, when I have Excel (for Data Cleaning)?

#### Excel 
- Excel is good for viewing data, performing basic analysis, and drawing simple graphs
- Audit trail of what was done is not known in Excel 
- Prone to error
- You have to pay for Excel

#### Python
- Would know exactly what has been done in python 
- Repeatability 
- Transparency and sharing 
- Easier to clean data (missing data, dates in different formats, no headers)
- Cleaning big amount of data is easier 
- Python is free and open source

In [1]:
import pandas as pd 
import numpy as np

### Dealing with Null data

In [2]:
# Here we are creating a series with np.nan as well as None in it
np.random.seed(501)
data = [1,2,4,5,6,7,4,np.nan,None]
n_data =pd.Series(np.random.choice(data, 500))

In [3]:
n_data

0      NaN
1      NaN
2        1
3        5
4        7
      ...
495      7
496      4
497    NaN
498      7
499      6
Length: 500, dtype: object

In [4]:
len(n_data)

500

### Checking Null data in series

In [5]:
# Checking at a glance if there is any null values
n_data.isnull().values.any()

True

In [6]:
# Counting the number of null values in the column. It should be noted that np.nan as well as None are both seen as null values
# in python
n_data.isnull().sum()

112

### Dealing with Null values.
There are a few ways of dealing with null values, depending on the data as well as the use case. You can....
- `drop()` the rows which have null values. 
    - A general rule of thumb, if the null values are **less then 10%** of the data, it can be dropped.
    - But this really depends on your data and use case. The 10% rule cannot be used all the time. 
- If the data is valuable, then you should replace the data accordingly, with reference to your use case.

#### Method 1 : Using `.dropna()` to remove the `Null` values

In [7]:
n_data_drop = n_data.dropna()

In [8]:
n_data_drop

2      1
3      5
4      7
5      6
6      4
      ..
494    2
495    7
496    4
498    7
499    6
Length: 388, dtype: object

In [9]:
# we can see that the length of the dataset has changed as the null values have been dropped
len(n_data_drop)

388

#### Method 2 : Replacing the null values using `fillna()`

In [13]:
n_data_0 = n_data.fillna(0)

In [14]:
n_data_0

0      0
1      0
2      1
3      5
4      7
      ..
495    7
496    4
497    0
498    7
499    6
Length: 500, dtype: int64

In [16]:
# we can see that the lenght of the series remains the same.

""" salah taip , n_data_f """

len(n_data_0)

500

#### `back fill`  and `forward fill` 
- These are both methods of dealing with null values

`bfill` (back fill) is when the value in the series is used to fill in the null values previous to it.

In [17]:
n_data_b = n_data.fillna(method='bfill')

In [18]:
n_data

0      NaN
1      NaN
2        1
3        5
4        7
      ...
495      7
496      4
497    NaN
498      7
499      6
Length: 500, dtype: object

In [19]:
## from the data we can see that the values in the series replace the values previous to it which are NaN
n_data_b

0      1
1      1
2      1
3      5
4      7
      ..
495    7
496    4
497    7
498    7
499    6
Length: 500, dtype: int64

`ffill` (forward fill) is when the value in the series is used to fill in the null values after it.

In [20]:
n_data_f = n_data.fillna(method='ffill')

In [21]:
n_data_f

0      NaN
1      NaN
2      1.0
3      5.0
4      7.0
      ...
495    7.0
496    4.0
497    4.0
498    7.0
499    6.0
Length: 500, dtype: float64

#### Exercise 1

In [23]:
# Check how many null values are in `n_data_f`

n_data_f.isnull().values.sum()

2

In [24]:
n_data_f

0      NaN
1      NaN
2      1.0
3      5.0
4      7.0
      ...
495    7.0
496    4.0
497    4.0
498    7.0
499    6.0
Length: 500, dtype: float64

In [ ]:
# Explain why the values at 0 and 1 are empty in `n_data_f` ?
ffill method take the last list and move it forward..

In [ ]:
# How would you deal with the NaN values in `n_data_f`?
use bfill method

In [26]:
# Replace the NaN values in `n_data_f`.
new_n_data_f = n_data_f.fillna(method = 'bfill')
new_n_data_f

0      1.0
1      1.0
2      1.0
3      5.0
4      7.0
      ...
495    7.0
496    4.0
497    4.0
498    7.0
499    6.0
Length: 500, dtype: float64

### String Data

In [33]:
strings = pd.Series(['Argentina      ', 'MALA  YSIA', 'USA$$$','United KINGdom', "Ayam" ])

In [34]:
strings

0    Argentina
1         MALA  YSIA
2             USA$$$
3     United KINGdom
4               Ayam
dtype: object

Dropping last element of data

In [35]:
strings.drop(4)

0    Argentina
1         MALA  YSIA
2             USA$$$
3     United KINGdom
dtype: object

Removing extra spaces

In [36]:
strings.str.strip()

0         Argentina
1        MALA  YSIA
2            USA$$$
3    United KINGdom
4              Ayam
dtype: object

making everything lower case

In [37]:
strings.str.lower()

0    argentina
1         mala  ysia
2             usa$$$
3     united kingdom
4               ayam
dtype: object

Replacing the special character.

In [38]:
strings.str.replace('$', '')

0    Argentina
1         MALA  YSIA
2                USA
3     United KINGdom
4               Ayam
dtype: object

`[^A-Za-z0-9]+` this is the representation of letter and numbers. The code below is replacing anything which is not a letter or a number.

In [39]:

strings.str.replace('[^A-Za-z0-9]+', '')

0        Argentina
1         MALAYSIA
2              USA
3    UnitedKINGdom
4             Ayam
dtype: object

### Exercise 2

In [47]:
# Clean the data in the variable `strings` above and save it as `strings_clean`
strings_v1 = strings.drop(4)
strings_v1

0    Argentina
1         MALA  YSIA
2             USA$$$
3     United KINGdom
dtype: object

In [57]:


new=strings_v1.str.strip()
new=new.str.replace('$','')
new = new.str.replace('[^A-Za-z0-9]+', '')
new = new.str.lower()

strings_clean = new
print(strings_clean)

0        argentina
1         malaysia
2              usa
3    unitedkingdom
dtype: object

In [94]:

""" nak buat for loop tapi tak jadi """

' nak buat for loop tapi tak jadi '

### Datetime 
`datetime` is a data type for dates.

In [59]:
# Note that here the format of the date is mm-dd-yyyy
dates = pd.date_range('1/1/2020', '2/1/2020', freq='h').to_series().reset_index(drop=True)

In [60]:
dates

0     2020-01-01 00:00:00
1     2020-01-01 01:00:00
2     2020-01-01 02:00:00
3     2020-01-01 03:00:00
4     2020-01-01 04:00:00
              ...
740   2020-01-31 20:00:00
741   2020-01-31 21:00:00
742   2020-01-31 22:00:00
743   2020-01-31 23:00:00
744   2020-02-01 00:00:00
Length: 745, dtype: datetime64[ns]

In [61]:
# extract the month of the date
dates.dt.month

0      1
1      1
2      1
3      1
4      1
      ..
740    1
741    1
742    1
743    1
744    2
Length: 745, dtype: int64

In [62]:
#obtain the hour of the date
dates.dt.hour

0       0
1       1
2       2
3       3
4       4
       ..
740    20
741    21
742    22
743    23
744     0
Length: 745, dtype: int64

### Using functions to modify data

In [63]:
# Lets use the data from above
n_data_0

0      0
1      0
2      1
3      5
4      7
      ..
495    7
496    4
497    0
498    7
499    6
Length: 500, dtype: int64

In [64]:
def calc(n):
    return (n +5.4) /n.mean()

In [65]:
n_data_0.mean()

3.122

In [66]:
(0+5.4)/3.122

1.7296604740550932

In [67]:
n_new = calc(n_data_0)

In [68]:
n_new.head(2)

0    1.72966
1    1.72966
dtype: float64

Making the 2 new series into a `dataframe`

In [69]:
df = pd.DataFrame(columns = ['old_data', 'modified_data'])

In [70]:
df['old_data'] = n_data_0
df['modified_data'] = n_new

In [71]:
df.head()

   old_data  modified_data
0         0       1.729660
1         0       1.729660
2         1       2.049968
3         5       3.331198
4         7       3.971813

### `apply`
- `apply` can be used to modify a pandas table.

In [72]:
def add(n):
    return (n +3) /5

In [78]:
# for 1 column
df['old_data'].apply(add)

0      0.6
1      0.6
2      0.8
3      1.6
4      2.0
      ...
495    2.0
496    1.4
497    0.6
498    2.0
499    1.8
Name: old_data, Length: 500, dtype: float64

In [74]:
# for all columns
df.apply(add)

     old_data  modified_data
0         0.6       0.945932
1         0.6       0.945932
2         0.8       1.009994
3         1.6       1.266240
4         2.0       1.394363
..        ...            ...
495       2.0       1.394363
496       1.4       1.202178
497       0.6       0.945932
498       2.0       1.394363
499       1.8       1.330301

[500 rows x 2 columns]

# `lambda`
We can also use `lambda` as an alternative to making out own function

Good example of `lambda` usage:
- [w3school python lambda](https://www.w3schools.com/python/python_lambda.asp)

In [75]:
df.apply(lambda n : (n +3) /5)

     old_data  modified_data
0         0.6       0.945932
1         0.6       0.945932
2         0.8       1.009994
3         1.6       1.266240
4         2.0       1.394363
..        ...            ...
495       2.0       1.394363
496       1.4       1.202178
497       0.6       0.945932
498       2.0       1.394363
499       1.8       1.330301

[500 rows x 2 columns]

### Exercise 3 
- Build a lambda function from this `x = y*3`and apply it to the `old_data` column of the df table

In [80]:
df['old_data'].apply(lambda x :x*3)

df['old_data']

0      0
1      0
2      1
3      5
4      7
      ..
495    7
496    4
497    0
498    7
499    6
Name: old_data, Length: 500, dtype: int64

### References:

- [Handling Missing Data](https://jakevdp.github.io/PythonDataScienceHandbook/03.04-missing-values.html)
- [
Using Functions and lambda example](https://www.kite.com/python/answers/how-to-modify-all-the-values-in-a-pandas-dataframe-column-in-python)